autobiography_text1 = "身為資管系學生的我，在修習系上各課程的同時，瞭解到在一個專案中，如何與人合作，並發掘自身偏好擔任開發的角色。" \
                     "之後在系上的畢業專案中，也主動帶領開發的部份，積極尋找適合的開發工具，並實作出來。"
autobiography_text2 = "由於大學三年累積的作品與經驗，我在大四得到一家軟體公司的實習機會，在加速他們產品上線的同時，我瞭解到真實在公司與人合作的狀況，" \
                      "且對於軟體所應具備的擴充性、維護性有了更深刻的認識，我也下定決心，自己未來要朝軟體開發一職發展。"
interest_text = "平日回家我喜歡看Youtube影片放鬆心情。我也喜歡單車運動，之前曾與朋友，花了五天以單車環台灣半島(西半邊)。下方為抵達終點-高雄的合影"
python_text1 = "我大三有修習AI課程，當時我們組對於分析知名線上遊戲-英雄聯盟有興趣，我主要負責開發爬蟲獲取遊戲數據網的數據，" \
              "也有參與簡單的模型實作。雖說後來的結果模型不太理想(56%左右)，但對於AI原理算是有初步的認識。"
python_text2 = "在實習時，公司內部的爬蟲、LineBot後端，幾乎都是我在負責的，過程中也漸漸意識到疊床架屋所帶來的不良影響，目前我在開發上也盡可能降低耦合性"
java_text = "我大一第一堂程式設計課就是Java起手，有在第二學期實作一APP，此後多半以Python開發為主。到了大四的實習，才又重新接觸。" \
            "在實際參與Spring Boot開發中，以及與資深工程師的交流裡，我對於物件導向概念有了更清楚的認識理解。"
javascript_text = "第一次接觸JS是在畢專中，開發中大部分的時間也在這上面。我當初選定Vue框架，是基於其對於新手較友好的特性。" \
                  "確實此特性也幫助我很大(雖然也踩了不少的坑)。之後在實習也接觸了jQuery函式庫，也深刻體會到主流框架的優勢" \
                  "(jQuery的資源跟不太上現今前端趨勢)"
project_text = "在畢業專題，我們這組希望透過大學所學，幫助學校附近的小本餐廳，讓他們有一個簡單操作就能獲得成本分析的系統。\n" \
               "專案進行時，我主要擔任開發的角色，以Web方式呈現專案(Vue + Django)，並以Json API實現前後端分離。"
intern_text = "1.運用Git與一資深工程師協作Web開發(jQuery + Java Spring Boot)\n" \
              "2.運用Django開發LineBot，並以Docker發布專案\n" \
              "3.運用Python維護爬蟲，並視情況開發新的爬蟲\n" \
              "4.運用SQL指令操作資料庫，並運用Python插入大量數據資料\n"
contact_me_text = "您好！\n如有任何問題要洽詢，請選擇以下方式聯繫我，感謝您的使用～"
